Repository: hsugawa8651/juliadoc-trans-ja
Catalog: omegat/project_save.tmx
Source language: en_us
Languages: ja

source: These are all single-argument functions, with the exception of atan2, which gives the angle in radians between the x-axis and the point specified by its arguments, interpreted as x and y coordinates.
ja: これらはすべて引数が1つの関数ですが、 atan2は例外で、角度をx軸と引数で 指定された点の ラジアン で表し、x座標とy 座標として解釈します。

source: These are available to all users on the system.
ja: これらは、システム上のすべてのユーザーが利用できます。

source: These are only available to the user who installed them.
ja: これらは、ユーザがインストールしたユーザのみが使用できます。

source: These are sometimes called "mutating" or "in-place" functions because they are intended to produce changes in their arguments after the function is called, not just return a value.
ja: これらの関数は、関数が呼び出された際に戻り値を返すだけでなく引数に変更を加えるため、「mutating」または「in-place」と呼ばれています。

source: These can likewise be used to write string literals:
ja: れらは同様に文字列リテラルを書くために使用することができます。

source: These characters are standardized together with a mapping to integer values between 0 and 127 by the ASCII
ja: これらの文字は、ASCII 規格 において、0から127の番号をそれぞれ割り振られて標準化されています。

source: These composite environments are called environment stacks.
ja: これらの複合環境は、環境スタックと呼ばれます。

source: These examples are hopefully helpful to illustrate how generated functions work, both in the definition end and at the call site; however, don't copy them, for the following reasons:
ja: これらの例は、定義された関数がどのように機能するかを説明するために役立つことが望まれます。 ただし、次の理由により、はコピーされません。<x/>:

source: These files may also be called JuliaProject.toml and JuliaManifest.toml, in which case Project.toml and Manifest.toml are ignored.
ja: これらのファイルは、JuliaProject.トミルおよびJuliaManifest.トミルと呼ばれます。この場合、Project.トミルとマニフェスト.トミルは無視されます。

source: These functions are included in the Base.Operators module even though they do not have operator-like names.
ja: こういった関数は、名前は演算子らしくなくても、Base.Operators モジュールに含まれています。

source: These functions are useful in Numeric Comparisons to avoid overhead from unnecessary (@ref conversion-and-promotion).
ja: これらの関数は、 時の不要な (@ref conversion-and-promotion).の オーバーヘッドを回避する際に有効です。

source: These have not all been assigned intelligible meanings yet, nor are they necessarily interpretable by applications, but all of these values are considered to be valid Unicode characters.
ja: これら全てのコードポイントに記号が割り当てられているわけではなく、また必ずしもアプリケーションによっては解釈できないものもありますが、 これら全てのコードポイントは有効なUnicode文字としてみなされます。

source: These loops are both exited early by using break.
ja: これらのループを早い段階で終了するには、共に、breakを使用します。

source: These map directly onto numeric types and operations that are natively supported on modern computers, thus allowing Julia to take full advantage of computational resources.
ja: これにより、Juliaは演算処理のリソースを最大限活用することができます。

source: These mathematical operations are defined over as broad a class of numerical values as permit sensible definitions, including integers, floating-point numbers, rationals, and complex numbers, wherever such definitions make sense.
ja: れらの数学的演算子は、 整数、浮動小数点数、有理数、およびそれらの複合などを許容可能な定義として、 幅広い数値クラスとして定義されています。

source: These may be used as follows:
ja: これらは次のように使用できます。

source: These operations generally work correctly as a fallback for any specific array implementation.
ja: これらの操作 一般的には、特定のアレイ実装のフォールバックとして正しく動作します。

source: These operators cannot be functions since Short-Circuit Evaluation requires that their operands are not evaluated before evaluation of the operator.) Accordingly, you can also apply them using parenthesized argument lists, just as you would any other function:
ja: これらの演算子は関数たりえません。 というのは、短絡評価Short-Circuit Evaluationは被演算子が評価されていなくても、演算の評価をおこなうからです。） したがって、演算子は、他の関数と同様に、括弧でくくった引数のリストに対して、適用することがきます。

source: These rules allow broadcasting to keep the sparse representation for operations that result in one or two dimensional outputs, but produce an Array for any other dimensionality.
ja: これらのルールにより、ブロードキャストを実行して、操作のスパース表現を維持することができます。 1次元または2次元の出力では、他の次元に対して配列を生成します。

source: These rules indicate that the combination of a SparseVecStyle with 0- or 1-dimensional arrays yields another SparseVecStyle, that its combination with a 2-dimensional array yields a SparseMatStyle, and anything of higher dimensionality falls back to the dense arbitrary-dimensional framework.
ja: これらの規則は、SparseVecStyleと0次元あるいは1次元の配列との組み合わせを示している。 2次元配列との組合せにより、別のSparseVecStyleを生成する。 は、SparseMatStyleを生成し、高い次元のすべては、密な任意の次元フレームワークに戻ります。

source: These statements also make the module named X, which results from loading the package code, available within the module where the import statement occurs.
ja: これらのステートメントは、インポート・ステートメントが発生するモジュール内で使用可能なパッケージ・コードをロードした結果として、Xという名前のモジュールを作成します。

source: These three kinds of environment each serve a different purpose:
ja: これら3種類の環境は、それぞれ異なる目的で提供されます。

source: These two modalities are identified by Julia as IndexLinear() and IndexCartesian().
ja: これらの2つの方法は、JuliaによってIndexLinear()およびIndexCartesian()と同定されている。

source: These values are 2.0^-23 and 2.0^-52 as Float32 and Float64 values, respectively.
ja: これらの値は2.0^-23と2.0^-52であり、Float32およびFloat64の値である。 それぞれ。

source: These values are 2.0^-23 and 2.0^-52 as `Float32` and `Float64` values, respectively.
ja: これらはそれぞれ `Float32` および `Float64` 値として2.0^-23および 2.0^-52 と なります。

source: They are equal to each other but have different binary representations, as can be seen using the `bitstring` function:
ja: これらは互いに等しいが、バイナリ表現は異なっている。 は、`bitstring'関数を使用して表示されます。

source: They are equal to each other but have different binary representations, as can be seen using the bits function: :
ja: この2つの0は同じ値ですが、bits 関数を使用した際に見られるように、それぞれ異なるバイナリ表現を持ちます。:

source: They are equal to each other but have different binary representations, as can be seen using the bitstring function:
ja: これらは互いに等しいが、バイナリ表現は異なっている。 は、bitstring関数を使用して表示されます。

source: They can contain " symbols without escaping.
ja: これらはエスケープなしで " 記号を含めることができます。

source: They can also be created anonymously, without being given a name, using either of these syntaxes:
ja: また、以下の構文のいずれかを使用して、名前をつけずに無名で、生成することができます。

source: They can be used as arguments, and they can be returned as values.
ja: 関数の引数としても、戻り値としても使うことができます。

source: They can be used similarly to Array{Bool} arrays (which store one byte per boolean value), and can be converted to/from the latter via Array(bitarray) and BitArray(array), respectively.
ja: これらは、Array{Bool}配列(ブール値ごとに1バイトを格納する)と同様に使用できます。 また、アレイ(bitarray)およびBitArray(配列)を介して、後者との間で変換を行うことができます。

source: They need not be of the same type, so long as they are each numeric values.
ja: それらがそれぞれ数値である限り、同じ型である必要はありません。

source: They produce an unsigned integer of the same size as the unsigned literal would do, with the two's complement of the value:
ja: これらは符号なしのリテラルと同じサイズの符号なし整数を生成します。 2年代の価値を補完することができます

source: They represent a collection of scalar indices that each span N dimensions, enabling a form of indexing that is sometimes referred to as pointwise indexing.
ja: コレクションを表します。 各スパンNの各次元を使用可能にするスカラー指数のことで、索引の形式が可能になります。 ポイントワイズインデックスと呼ばれることもあります。

source: They therefore must take the form of a literal tuple, not a variable, and cannot reference local variables.
ja: したがって、それらは変数ではなく、リテラル・タプルの形をとる必要があります。 ローカル変数を参照できません。

source: This is because (Cstring) is just the expression Cstring surrounded by parentheses, rather than a 1-tuple containing Cstring:
ja: これ (Cstring)は、Cstringで囲まれた括弧で囲まれた表現であり Cstring:を含む1組のタプル

source: This separation is typically quite natural.
ja: これ 分離は、典型的には非常に自然なものである。

source: This will construct a 1-d array with element type T, initialized to contain elements A, B, C, etc.
ja: これ 要素タイプTを持つ1dアレイを構築し、要素A、B、Cを含むように初期化します。 その他。

source: This Squares sequence is starting to look more and more like a vector as we've added behaviors to it.
ja: このSquaresシーケンスが開始され始めています。 これは、ビヘイビアを追加したときのベクトルに似ています。

source: This UUID identifies which Priv package to load and use when the main application evaluates import Priv.
ja: このUUIDは、メインアプリケーションがインポートPrivを評価するときにロードおよび使用するPrivパッケージを識別します。

source: This allows custom array implementations to provide their own copyto! specialization to customize and optimize broadcasting.
ja: これにより、カスタム・アレイの実装が可能になります。 独自のcopyto!特殊化を提供してカスタマイズし 放送を最適化する。

source: This allows describing "the set of method definitions visible to a given runtime environment" as a single number, or "world age".
ja: これにより、「実行時環境から見えるメソッド定義の集合」を、単一の数値「世界世代」として記述することができます。

source: This allows for efficient indexing into strings by the byte index of an encoded representation rather than by a character index, which cannot be implemented both efficiently and simply for variable-width encodings of Unicode strings.
ja: これは、Unicode文字列 の可変幅のエンコードに対して効率的かつシンプルに実装できない文字列インデックスではなく、エンコードされた表現のバイトインデックスによる文字列 への効率的なインデックスを可能にします。

source: This allows sophisticated code generation without extra build steps, and also allows true Lisp-style macros operating at the level of abstract syntax trees.
ja: これにより、高度なコード生成が可能になります。 追加のビルドステップで、抽象構文ツリーのレベルで動作する真のLispスタイルのマクロが可能になります。

source: This allows, for example, passing an argv pointer array of type Vector{String} to an argument of type Ptr{Ptr{Cchar}}.
ja: これにより、例えば、argvポインタ配列を通過させることができる。 Vector{String}は、Ptr{Ptr{Cchar}}の型を引数にします。

source: This also means that you can assign and pass around operators such as `+()` and `*()` just like you would with other function values:
ja: そのため、 `+()`や `*()`といった演算子も、他の関数値と同様に、代入や受け渡しを、行うことができます。.

source: This applies not only to arrays and other mutable objects which are normally heap-allocated, but also to scalar values such as integers and floats which are normally stack-allocated and commonly passed in registers when using C or Julia calling conventions.
ja: これは 通常はヒープ割り当てされた配列やその他のmutableオブジェクトですが 通常スタック割り当てされた整数や浮動小数点のようなスカラー値 一般的には、CまたはJuliaの呼び出し規約を使用するときにレジスタで渡されます。

source: This argument will be evaluated at compile-time, when the containing method is defined.
ja: この引数は、containingメソッドが定義された時にコンパイル時に評価されます。

source: This automatic provision of constructors is equivalent to the following explicit declaration:
ja: コンストラクタの自動プロビジョニングは、次の明示的な宣言に相当します。

source: This avoids the need to continually check for null values.
ja: これにより、nullの値を連続的にチェックする必要がなくなります。

source: This basic framework is extensible in three major ways:
ja: この基本的なフレームワークは、次の3つの主要な方法で拡張できます。

source: This behavior is based on the observation that when one uses unsigned hex literals for integer values, one typically is using them to represent a fixed numeric byte sequence, rather than just an integer value.
ja: この動作は、整数値に符号なし16進リテラルを使用する際、ただの整数ではなく、 通常固定された数値のバイト列を表すという傾向に基づいています。

source: This behavior is frequently used in Julia to form an alternative to very short if statements.
ja: Juliaでは、非常に短いif文の代わりに、短絡評価が頻繁に利用されます。

source: This behavior occurs when the first `ccall` argument contains references to non-constants, such as local variables, function arguments, or non-constant globals.
ja: この振る舞いは、最初の`ccall'引数が参照を含んでいるときに発生します。 ローカル変数、関数引数、非定数グローバルなどの非定数に指定します。

source: This call will attempt to infer type information from the keys and values (i.e. this example creates a Dict{String, Int64}).
ja: この呼び出しは、以下のようなタイプ情報を推測しようとします。 キーと値(すなわち、この例では、Dict{String,Int64}を作成します)。

source: This can be accomplished with the break keyword:
ja: これはbreakキーワードで実現できます：

source: This can be done with the syntax $(xs...).
ja: これは、構文$(xs...)で行うことができます。

source: This can be especially useful when targeting unusual platforms such as GPGPUs.
ja: これは、GPGPUsなどの特殊なプラットフォームをターゲットにする場合に特に役立ちます。

source: This can be expressed much more simply with (@ref man-vectorized) and by combining it with a normal integer index (instead of extracting the first page from A as a separate step).
ja: これは、(@ref man-vectorized)ではるかに簡単に表現することができます。 そして、それを通常の整数インデックスと組み合わせることで( 最初のページから個別のステップとして。

source: This can be expressed much more simply with (@ref man-vectorized) and by combining it with a normal integer index (instead of extracting the first page from A as a separate step). It can even be combined with a :
ja: これは、(@ref manベクトル化)ではるかに簡単に表現することができます。 そして、それを通常の整数インデックスと組み合わせることで( 最初のページから別のステップとして。また、:と組み合わせることもできます。

source: This can happen when one of their dependencies is shadowed by a version in an earlier environment in the stack.
ja: これは、その依存関係の一つが、スタック内の以前の環境でバージョンによって影付けされている場合に発生する可能性があります。

source: This catch-all is less specific than any other possible method definition for a pair of parameter values, so it will only be called on pairs of arguments to which no other method definition applies.
ja: この全捕捉は、どの引数のペアに対する他のメソッド定義よりも特化していないため、他のメソッド定義が適用されない引数のペアに対してのみ呼び出されます。

source: This code will be common to both versions, and is run-time code in both versions (it will be quoted and returned as an expression from the generated version).
ja: このコードは両方のバージョンに共通で、両方のバージョンで実行されるランタイム・コードです。 (これは、生成されたバージョンからの式として引用され、返されます)。

source: This condition is relaxed for incrementally-loaded precompiled modules to allow calling any function in the module.
ja: この状態 は、モジュール内の任意の関数を呼び出し可能にするために、段階的にロードされたプリコンパイル済みモジュールに対して、リラックスされます。

source: This construction avoids the multiplication and addition operations.
ja: この構成により、乗算と加算演算が回避されます。

source: This constructor will be invoked by the syntax SummedArray(a).
ja: このコンストラクタは、構文SummedArray(a)によって呼び出されます。

source: This converts the return value to the specified type.
ja: これで、返り値を指定の型に変換できます。

source: This could be written more concisely using the ternary operator.
ja: これは三項演算子を使ってより簡潔に書くことができます。

source: This creates a function taking one argument x and returning the value of the polynomial x^2 + 2x - 1 at that value.
ja: このような構文で、1つの引数 x、 戻り値が多項式x^2 + 2x - 1になる関数が生成されます。

source: This declaration has the same effect as the earlier definition of the Foo type without an explicit inner constructor method.
ja: この宣言は、明示的にはFooタイプの以前の定義と同じ効果を持っています。 インナーコンストラクタメソッド。

source: This declaration makes constructor calls without explicit type parameters, like Point(1,2)
ja: この宣言は、ポイント(1,2)のような明示的なタイプパラメータなしのコンストラクタ呼び出しを行います。

source: This dependency graph represented as a dictionary, looks like this:
ja: この依存性グラフは辞書として表され、次のようになります。

source: This distinction determines which scalar indexing methods the type must define.
ja: この区別によって、タイプが定義するスカラー・インデックス・メソッドが決まります。

source: This does not occur when Julia code is run in other ways.
ja: この処理は、Juliaコードがその他の方法で実行された場合には実施されません。

source: This error indicates that the conditional was of the wrong type: Int64 rather than the required Bool.
ja: このエラーは、条件式の型が誤りであることを示しています。 Int64 は、要求されるBoolに適合しません。

source: This error indicates that the conditional was of the wrong type: `Int64` rather than the required `Bool`.
ja: このエラーは、条件が間違ったタイプであることを示しています:`Int64`。 必要な`Bool'よりも多くなります。

source: This example first allocates an array of bytes, then calls the C library function gethostname
ja: この例ではまず、バイトの配列を割り当て、次にCライブラリ関数gethostnameを呼び出します。

source: This example highlights the general principle that the adjacent representable floating-point numbers also have adjacent binary integer representations.
ja: この例では、隣接する浮動小数点数は隣接する二進整数を持つという一般的な原則を表しています。

source: This example map includes three different kinds of package locations:
ja: このマップには、次の3種類のパッケージ位置が含まれています。

source: This experimental interface supports Julia's multi-threading capabilities.
ja: この実験インターフェースは、Juliaのマルチスレッド機能をサポートしています。

source: This expression constructs a name using string, then substitutes this name into a new `ccall`
ja: この表現はストリングを使用して名前を作成し、次にこの名前を新しい`ccall'に置き換えます。

source: This form can be used to call C library functions, functions in the Julia runtime, or functions in an application linked to Julia.
ja: このフォームを使用してCライブラリを呼び出すことができます。 関数、Juliaランタイム内の関数、またはJuliaにリンクされたアプリケーションの関数です。

source: This function definition applies only to calls where x and y are both values of type `Float64`:
ja: この関数定義は、xとyの値の型が両方ともFloat64である呼び出しにだけ、適用されます：

source: This function is intentionally similar to the behavior of `getindex` and `setindex!` (e.g. [] access syntax).
ja: この関数は意図的に似ています `getindex'および`setindex!`(例:[]アクセス構文)の動作です。

source: This function will always return an Int8 regardless of the types of x and y.
ja: この関数は、xと yの型によらず、いつでも Int8 の値を返す。

source: This guarantees that all objects of the declared type must come into existence by a call to one of the inner constructor methods provided with the type, thereby giving some degree of enforcement of a type's invariants.
ja: これにより、宣言されたタイプのすべてのオブジェクトが、次のように指定されることが保証されます。 型で提供される内部コンストラクタメソッドの一つを呼び出して存在することによって タイプの不変度のある程度の強制。

source: This has the exact same effect as the previous definition of foo.
ja: これは、fooの前の定義とまったく同じ効果を持っています。

source: This includes `Colon` (:) to select all indices within the entire dimension, ranges of the form a:c or a:b:c to select contiguous or strided subsections, and arrays of booleans to select elements at their true indices.
ja: これには 「コロン」(:)は、次元全体のすべてのインデックスを選択するために使用されます。 a:cまたはa:b:cto select連続またはストライドされたものを選択するための範囲 サブセクションは、真のインデックスで選択要素を選択するためのブール演算の配列です。

source: This includes:
ja: これには次のものが含まれます。

source: This is invisible to users as it is immediately realized through a call to copy, but it is this container that provides the basis for broadcast's extensibility for authors of custom types.
ja: これは コピーの呼び出しによってすぐに実現されるため、ユーザには見えませんが、このコンテナはこのコンテナです。 は、カスタム・タイプの作成者にとって、ブロードキャストの拡張性の基礎を提供します。

source: This is a powerful construct: both exception handling and cooperative multitasking are implemented in Julia using tasks.
ja: これは強力な構成であり、例外処理とも呼ばれます。 タスクを使用して、Juliaで協調的マルチタスクを実装します。

source: This is a somewhat contrived example since we could produce the same behavior more clearly by negating the condition and placing the println call inside the if block.
ja: これは、同じ振る舞いをより明確に生成することができるので、多少工夫された例です。 ブロックがブロックの場合には、<x/>printlnの呼び出しをの内部に配置します。

source: This is a very common pattern throughout Julia Base: a small set of required methods define an informal interface that enable many fancier behaviors.
ja: これは、Julia Base全体で非常に一般的なパターンです。必要なメソッドの集合です。 多くのファン的な振る舞いを可能にするインフォーマルなインターフェースを定義します。

source: This is accomplished by dividing the given numerator and denominator values by their greatest common divisor, computed using the gcd function.
ja: これは、与えられた分子を分割することによって達成される。 分母値は、gcd関数を使用して計算され、最大公約数によって計算されます。

source: This is accomplished just by making an appropriate call with `ccall` syntax, which looks like an ordinary function call.
ja: これは、適切な呼び出しを行うことによって実現されます。 `ccall'構文は、通常の関数呼び出しのように見えます。

source: This is again determined by the computed broadcast style.
ja: これは、計算されたブロードキャスト・スタイルによって再度決定されます。

source: This is because argument parsing in shebang is platform-dependent and not well-specified.
ja: これは、シェバンの引数の構文解析が はプラットフォーム依存であり、よく指定されていません。

source: This is different than traditional object-oriented languages, where dispatch occurs based only on the first argument, which often has a special argument syntax, and is sometimes implied rather than explicitly written as an argument.
ja: これは、従来のオブジェクト指向言語とは異なります。従来のオブジェクト指向言語では、通常は最初の引数のみに基づいてディスパッチが行われ、最初の引数を特別視して引数に見えないような構文を持つものもあります。

source: This is fine if a named function effecting the transform one wants already exists to pass as the first argument to `map()`.
ja: 配列に対して実行したい変換が、名前つきの関数として存在していて、`map()`の1番目の引数に使える場合は、問題ありません。

source: This is how the name Priv can refer to different packages in the main project than it does in one of its package's dependencies, which allows for duplicate names in the package ecosystem.
ja: これは、Privという名前が、パッケージの依存関係の一つとは異なるパッケージをメイン・プロジェクトで参照できるため、パッケージ・エコシステム内で重複する名前を使用することができます。

source: This is just a special kind of 32-bit primitive type whose numeric value represents a Unicode code point.
ja: これは数値がUnicodeコードポイントを表す特殊な種類の32ビットのビット型です。

source: This is key to Julia's ability to statically infer and compile code to run fast, without the usual JIT tricks and overhead.
ja: これは、Juliaが静的にコードを推論しコンパイルする際に、通常のJITトリックやオーバーヘッドがなくてすむ鍵となります。

source: This is more readable and convenient and equivalent to the above string concatenation -- the system rewrites this apparent single string literal into a concatenation of string literals with variables.
ja: この方法は呼びやすくかつ便利です。システムが単一文字リテラルを変数と文字列リテラルの連結に書き換えるので、上記の文字列連結と動作は変わりません。

source: This is referred to as quoting.
ja: これは引用符と呼ばれます。

source: This is such an important part of the operation that it is stored as the first type parameter of the Broadcasted type, allowing for dispatch and specialization.
ja: これは の最初のタイプパラメータとして格納される操作の重要な部分です。 ブロードキャストされたタイプで、ディスパッチと特殊化を可能にします。

source: This is the same behavior found in Scheme, most Lisps, Python, Ruby and Perl, among other dynamic languages.
ja: こうした挙動は,Scheme,Lispの大部分,Python,Ruby,Perl,その他の動的言語と同様です。

source: This is useful for defining strings within code that is indented.
ja: これはインデントされたコード内 の文字列を定義するのに便利です。

source: This is wasteful when dimensions get large, so Julia provides `broadcast`, which expands singleton dimensions in array arguments to match the corresponding dimension in the other array without using extra memory, and applies the given function elementwise:
ja: 次元が大きくなると無駄になります。したがって、Juliaは'ブロードキャスト''を提供します。これは拡張されます。 配列引数内の単一の次元を、他の配列内の対応する次元に一致させます。 は、余分なメモリを使用せず、指定された関数要素を適用します。

source: This kind of definition of function behavior by dispatch is quite common -- idiomatic, even -- in Julia.
ja: Juliaでは、このようにディスパッチを使って関数の動作を定義するのは、まったく普通であって、慣用的でさえあります。

source: This kind of environment was the only kind that existed in Julia 0.6 and earlier.
ja: この種の環境は、ジュリア0.6以前に存在していた唯一の種であった。

source: This kind of quoting does not yet have syntax, but is represented internally as an object of type QuoteNode.
ja: この種の引用符はまだ構文はありませんが、内部的に表現されています QuoteNode型のオブジェクトとして使用されます。

source: This kind of syntax is convenient for data processing, but in other languages vectorization is also often required for performance: if loops are slow, the "vectorized" version of a function can call fast library code written in a low-level language.
ja: この種の構文はデータ処理に便利ですが、その他の言語ではベクトル化されています。 また、パフォーマンスには多くの場合、ループが必要となります。ループが低速である場合、関数の「ベクトル化」バージョンが必要です。 は、低レベル言語で記述された高速ライブラリコードを呼び出すことができます。

source: This leverages a fallback implementation of copyto! that converts the wrapper into a Broadcasted{Nothing}.
ja: これは、ラッパーを変換するcopyto!のフォールバック実装を活用します。 ブロードキャスト{なし}.

source: This makes it simple to relocate a subtree of source files.
ja: これによって、ソースファイルのサブツリーを簡単に再配置することができます。

source: This makes writing polynomial expressions much cleaner:
ja: これにより多項式をより明確に記載することができます。:

source: This manifest file describes a possible complete dependency graph for the App project:
ja: このマニフェストファイルは、アプリケーションプロジェクトの完全な依存関係グラフを記述しています。

source: This may sound like a strange restriction, but remember that since C is not a dynamic language like Julia, its functions can only accept argument types with a statically-known, fixed signature.
ja: これは奇妙な制限のように聞こえるかもしれませんが でもCはジュリアのようなダイナミックな言語ではないので その関数は、静的に既知の固定署名を持つ引数型の引数型のみを受け入れることができます。

source: This means that @cfunction-generated pointers cannot be used in calls where WINAPI expects stdcall
ja: つまり @cfunction-生成されたポインタは、WINAPIがstdcallを想定している呼び出しでは使用できません。

source: This means that calling f() is equivalent to calling f(1,2).
ja: これは、f()の呼び出しとf(1,2)の呼び出しは同等なことを意味します。

source: This means that multiple independent parties can maintain both public and private packages and registries of them, and that projects can depend on a mix of public and private packages from different registries.
ja: これは、複数の独立した当事者が、パブリック・パッケージとプライベート・パッケージの両方を維持することができること、およびプロジェクトが異なるレジストリーからのパブリック・パッケージとプライベート・パッケージの混在に依存することを意味します。

source: This means that new variables defined inside the if clauses can be used after the if block, even if they weren't defined before.
ja: つまり、新しい変数は の場合は<x/>の範囲内で、の場合はの範囲内で定義されていても、定義されていない場合でも定義されます。 の前にあります。

source: This means that not every byte index into a UTF-8 string is necessarily a valid index for a character.
ja: これは、必ずしも全てのUTF-8文字列のインデックスバイトが文字に対して有効なインデックスではないことを意味します。
